In [134]:
import numpy as np
import matplotlib.pyplot as plt
import sklearn
import pandas as pd

In [135]:
data = pd.read_csv('./titanic/Titanic-Dataset.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [136]:
data_dropped = data.drop(['Sex','Cabin'],axis=1)
data_dropped.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,S

In [137]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [138]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [139]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [140]:
from sklearn.preprocessing import OneHotEncoder, LabelEncoder, OrdinalEncoder, TargetEncoder
import category_encoders as ce

encoder1 = OneHotEncoder(sparse_output=False)
encoder2 = LabelEncoder()
encoder3 = OrdinalEncoder()
encoder4 = ce.TargetEncoder()

data_encoder2 = data.copy()
data_encoder2['Sex_ord'] = encoder3.fit_transform(data[['Sex']])
data_encoder2['Sex_lab'] = encoder2.fit_transform(data['Sex'])
data_encoder2['Sex_tar'] = encoder4.fit_transform(data['Sex'], data['Fare'])
data_encoder2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_ord,Sex_lab,Sex_tar
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1.0,1,25.523893
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0.0,0,44.479818
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0.0,0,44.479818
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0.0,0,44.479818
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1.0,1,25.523893

In [141]:
df = data.copy()
enc_lab = LabelEncoder()

df['Embarked'] = enc_lab.fit_transform(df['Embarked'])
df['Sex'] = enc_lab.fit_transform(df['Sex'])
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2

In [142]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    int32
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    int32
dtypes: float64(2), int32(2), int64(5), object(3)
memory usage: 76.7+ KB

In [143]:
df_age_null = df[df['Age'].isnull()]
df_age_notnull = df[~df['Age'].isnull()]

feature_reg = ['Survived', 'Pclass', 'Sex', 'SibSp', 'Parch', 'Fare', 'Embarked']

x_train = df_age_notnull[feature_reg]
y_train = df_age_notnull['Age']
x_test = df_age_null[feature_reg]

In [144]:
from sklearn.ensemble import RandomForestRegressor

model = RandomForestRegressor()
model.fit(x_train,y_train)

df_age_null['Age'] = (model.predict(x_test))

df_age_null.head()

C:\Users\sinah\AppData\Local\Temp\ipykernel_36368\3669297004.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_age_null['Age'] = (model.predict(x_test))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",1,32.511220,0,0,330877,8.4583,NaN,1
17,18,1,2,"Williams, Mr. Charles Eugene",1,35.128176,0,0,244373,13.0000,NaN,2
19,20,1,3,"Masselmani, Mrs. Fatima",0,15.452500,0,0,2649,7.2250,NaN,0
26,27,0,3,"Emir, Mr. Farred Chehab",1,35.727645,0,0,2631,7.2250,NaN,0
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",0,19.314500,0,0,330959,7.8792,NaN,1

In [145]:
df.loc[df['Age'].isnull(),'Age'] = model.predict(x_test).round().astype(int)
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2
5,6,0,3,"Moran, Mr. James",1,33.0,0,0,330877,8.4583,NaN,1
6,7,0,1,"McCarthy, Mr. Timothy J",1,54.0,0,0,17463,51.8625,E46,2
7,8,0,3,"Palsson, Master. Gosta Leonard",1,2.0,3,1,349909,21.0750,NaN,2
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27.0,0,2,347742,11.1333,NaN,2
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14.0,1,0,237736,30.0708,NaN,0

In [146]:
df_cabin_null = df[df['Cabin'].isnull()]
df_cabin_notnull = df[~df['Cabin'].isnull()]

feature_class = ['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']

x_train_cabin = df_cabin_notnull[feature_class]
y_train_cabin = df_cabin_notnull['Cabin']

x_test_cabin = df_cabin_null[feature_class]

In [147]:
from sklearn.ensemble import RandomForestClassifier

model_cabin = RandomForestClassifier()
model_cabin.fit(x_train_cabin, y_train_cabin)


df_cabin_null['Cabin'] = model_cabin.predict(x_test_cabin)
df_cabin_null.head()

c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")
c:\Users\sinah\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\utils\multiclass.py:213: UserWarning: The number of unique classes is greater than 50% of the number of samples.
  y_type = type_of_target(y, input_name="y")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,F G73,2
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,E101,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,F G63,2
5,6,0,3,"Moran, Mr. James",1,33.0,0,0,330877,8.4583,F38,1
7,8,0,3,"Palsson, Master. Gosta Leonard",1,2.0,3,1,349909,21.0750,F4,2

In [148]:
df_cabin_null.info()

<class 'pandas.core.frame.DataFrame'>
Index: 687 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  687 non-null    int64
 1   Survived     687 non-null    int64
 2   Pclass       687 non-null    int64
 3   Name         687 non-null    object
 4   Sex          687 non-null    int32
 5   Age          687 non-null    float64
 6   SibSp        687 non-null    int64
 7   Parch        687 non-null    int64
 8   Ticket       687 non-null    object
 9   Fare         687 non-null    float64
 10  Cabin        687 non-null    object
 11  Embarked     687 non-null    int32
dtypes: float64(2), int32(2), int64(5), object(3)
memory usage: 64.4+ KB

In [149]:
df.loc[df['Cabin'].isnull(),'Cabin'] = model_cabin.predict(x_test_cabin)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,F G73,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,E101,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,F G63,2

In [150]:
tip = pd.read_csv('./tips/tip.csv')
tip.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [151]:
tip.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [152]:
tip['rate'] = (tip['tip'] / tip['total_bill']).round(3)
tip.assign(tip_rate=tip['tip'] / tip['total_bill'])

     total_bill   tip     sex smoker   day    time  size   rate  tip_rate
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059  0.059447
1         10.34  1.66    Male     No   Sun  Dinner     3  0.161  0.160542
2         21.01  3.50    Male     No   Sun  Dinner     3  0.167  0.166587
3         23.68  3.31    Male     No   Sun  Dinner     2  0.140  0.139780
4         24.59  3.61  Female     No   Sun  Dinner     4  0.147  0.146808
..          ...   ...     ...    ...   ...     ...   ...    ...       ...
239       29.03  5.92    Male     No   Sat  Dinner     3  0.204  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.074  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.160  0.159744

[244 rows x 9 columns]

In [153]:
tip[tip['time']=='Dinner']

     total_bill   tip     sex smoker   day    time  size   rate
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059
1         10.34  1.66    Male     No   Sun  Dinner     3  0.161
2         21.01  3.50    Male     No   Sun  Dinner     3  0.167
3         23.68  3.31    Male     No   Sun  Dinner     2  0.140
4         24.59  3.61  Female     No   Sun  Dinner     4  0.147
..          ...   ...     ...    ...   ...     ...   ...    ...
239       29.03  5.92    Male     No   Sat  Dinner     3  0.204
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.074
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098
243       18.78  3.00  Female     No  Thur  Dinner     2  0.160

[176 rows x 8 columns]

In [154]:
tip[(tip['time']=='Dinner') & (tip['size'] > 2)]

     total_bill   tip     sex smoker  day    time  size   rate
1         10.34  1.66    Male     No  Sun  Dinner     3  0.161
2         21.01  3.50    Male     No  Sun  Dinner     3  0.167
4         24.59  3.61  Female     No  Sun  Dinner     4  0.147
5         25.29  4.71    Male     No  Sun  Dinner     4  0.186
7         26.88  3.12    Male     No  Sun  Dinner     4  0.116
..          ...   ...     ...    ...  ...     ...   ...    ...
227       20.45  3.00    Male     No  Sat  Dinner     4  0.147
230       24.01  2.00    Male    Yes  Sat  Dinner     4  0.083
231       15.69  3.00    Male    Yes  Sat  Dinner     3  0.191
238       35.83  4.67  Female     No  Sat  Dinner     3  0.130
239       29.03  5.92    Male     No  Sat  Dinner     3  0.204

[70 rows x 8 columns]

In [155]:
tip[(tip['total_bill'] > 20) & (tip['rate'] > 0.2)]

     total_bill   tip     sex smoker   day    time  size   rate
46        22.23  5.00    Male     No   Sun  Dinner     2  0.225
88        24.71  5.85    Male     No  Thur   Lunch     2  0.237
181       23.33  5.65    Male    Yes   Sun  Dinner     2  0.242
183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.281
185       20.69  5.00    Male     No   Sun  Dinner     5  0.242
214       28.17  6.50  Female    Yes   Sat  Dinner     3  0.231
239       29.03  5.92    Male     No   Sat  Dinner     3  0.204

In [156]:
tip[(tip['tip'] > 8) | (tip['size'] > 5)]

     total_bill   tip     sex smoker   day    time  size   rate
125       29.80   4.2  Female     No  Thur   Lunch     6  0.141
141       34.30   6.7    Male     No  Thur   Lunch     6  0.195
143       27.05   5.0  Female     No  Thur   Lunch     6  0.185
156       48.17   5.0    Male     No   Sun  Dinner     6  0.104
170       50.81  10.0    Male    Yes   Sat  Dinner     3  0.197
212       48.33   9.0    Male     No   Sat  Dinner     4  0.186

In [157]:
tip[tip['tip'] == tip['tip'].max()]

     total_bill   tip   sex smoker  day    time  size   rate
170       50.81  10.0  Male    Yes  Sat  Dinner     3  0.197

In [158]:
tip[tip['tip'] > tip['tip'].quantile(0.95)]

     total_bill    tip     sex smoker   day    time  size   rate
23        39.42   7.58    Male     No   Sat  Dinner     4  0.192
44        30.40   5.60    Male     No   Sun  Dinner     4  0.184
47        32.40   6.00    Male     No   Sun  Dinner     4  0.185
52        34.81   5.20  Female     No   Sun  Dinner     4  0.149
59        48.27   6.73    Male     No   Sat  Dinner     4  0.139
88        24.71   5.85    Male     No  Thur   Lunch     2  0.237
141       34.30   6.70    Male     No  Thur   Lunch     6  0.195
170       50.81  10.00    Male    Yes   Sat  Dinner     3  0.197
181       23.33   5.65    Male    Yes   Sun  Dinner     2  0.242
183       23.17   6.50    Male    Yes   Sun  Dinner     4  0.281
212       48.33   9.00    Male     No   Sat  Dinner     4  0.186
214       28.17   6.50  Female    Yes   Sat  Dinner     3  0.231
239       29.03   5.92    Male     No   Sat  Dinner     3  0.204

In [159]:
tip.groupby('day').size()

day
Fri     19
Sat     87
Sun     76
Thur    62
dtype: int64

In [160]:
tip.groupby('size').size()

size
1      4
2    156
3     38
4     37
5      5
6      4
dtype: int64

In [161]:
tip.groupby('size').mean('rate')

      total_bill       tip      rate
size
1       7.242500  1.437500  0.217500
2      16.448013  2.582308  0.165731
3      23.277632  3.393158  0.152237
4      28.613514  4.135405  0.145865
5      30.068000  4.028000  0.141600
6      34.830000  5.225000  0.156250

In [162]:
tip.groupby('size')['rate'].mean()

size
1    0.217500
2    0.165731
3    0.152237
4    0.145865
5    0.141600
6    0.156250
Name: rate, dtype: float64

In [163]:
tip.groupby('day').agg({'rate': np.mean, 'total_bill': np.mean, 'day': np.size})

C:\Users\sinah\AppData\Local\Temp\ipykernel_36368\1084481698.py:1: FutureWarning: The provided callable <function mean at 0x000001CB58601120> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  tip.groupby('day').agg({'rate': np.mean, 'total_bill': np.mean, 'day': np.size})
C:\Users\sinah\AppData\Local\Temp\ipykernel_36368\1084481698.py:1: FutureWarning: The provided callable <function mean at 0x000001CB58601120> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  tip.groupby('day').agg({'rate': np.mean, 'total_bill': np.mean, 'day': np.size})

          rate  total_bill  day
day
Fri   0.170000   17.151579   19
Sat   0.153149   20.441379   87
Sun   0.166921   21.410000   76
Thur  0.161274   17.682742   62

In [164]:
tip.groupby(['smoker','sex']).agg({'rate': [np.mean, np.size]})

C:\Users\sinah\AppData\Local\Temp\ipykernel_36368\718769567.py:1: FutureWarning: The provided callable <function mean at 0x000001CB58601120> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  tip.groupby(['smoker','sex']).agg({'rate': [np.mean, np.size]})

                   rate
                   mean size
smoker sex
No     Female  0.156926   54
       Male    0.160670   97
Yes    Female  0.182152   33
       Male    0.152817   60

In [165]:
tip.nlargest(10,columns=['tip'])
# tip.nsmallest(5,columns='tip')

     total_bill    tip     sex smoker   day    time  size   rate
170       50.81  10.00    Male    Yes   Sat  Dinner     3  0.197
212       48.33   9.00    Male     No   Sat  Dinner     4  0.186
23        39.42   7.58    Male     No   Sat  Dinner     4  0.192
59        48.27   6.73    Male     No   Sat  Dinner     4  0.139
141       34.30   6.70    Male     No  Thur   Lunch     6  0.195
183       23.17   6.50    Male    Yes   Sun  Dinner     4  0.281
214       28.17   6.50  Female    Yes   Sat  Dinner     3  0.231
47        32.40   6.00    Male     No   Sun  Dinner     4  0.185
239       29.03   5.92    Male     No   Sat  Dinner     3  0.204
88        24.71   5.85    Male     No  Thur   Lunch     2  0.237

In [166]:
tip.nlargest(10,columns=['size','tip'])

     total_bill   tip     sex smoker   day    time  size   rate
141       34.30  6.70    Male     No  Thur   Lunch     6  0.195
143       27.05  5.00  Female     No  Thur   Lunch     6  0.185
156       48.17  5.00    Male     No   Sun  Dinner     6  0.104
125       29.80  4.20  Female     No  Thur   Lunch     6  0.141
155       29.85  5.14  Female     No   Sun  Dinner     5  0.172
142       41.19  5.00    Male     No  Thur   Lunch     5  0.121
185       20.69  5.00    Male     No   Sun  Dinner     5  0.242
216       28.15  3.00    Male    Yes   Sat  Dinner     5  0.107
187       30.46  2.00    Male    Yes   Sun  Dinner     5  0.066
212       48.33  9.00    Male     No   Sat  Dinner     4  0.186

In [167]:
tip.sort_values(['size','tip'], ascending=False)

     total_bill   tip     sex smoker   day    time  size   rate
141       34.30  6.70    Male     No  Thur   Lunch     6  0.195
143       27.05  5.00  Female     No  Thur   Lunch     6  0.185
156       48.17  5.00    Male     No   Sun  Dinner     6  0.104
125       29.80  4.20  Female     No  Thur   Lunch     6  0.141
155       29.85  5.14  Female     No   Sun  Dinner     5  0.172
..          ...   ...     ...    ...   ...     ...   ...    ...
236       12.60  1.00    Male    Yes   Sat  Dinner     2  0.079
222        8.58  1.92    Male    Yes   Fri   Lunch     1  0.224
82        10.07  1.83  Female     No  Thur   Lunch     1  0.182
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.326
111        7.25  1.00  Female     No   Sat  Dinner     1  0.138

[244 rows x 8 columns]

In [168]:
tip.groupby('day')['rate'].rank(method='first')

0       1.0
1      38.0
2      44.0
3      25.0
4      31.0
       ...
239    78.0
240     5.0
241    12.0
242    13.0
243    36.0
Name: rate, Length: 244, dtype: float64

In [169]:
tip.loc[tip['tip'] > 5]

     total_bill    tip     sex smoker   day    time  size   rate
23        39.42   7.58    Male     No   Sat  Dinner     4  0.192
44        30.40   5.60    Male     No   Sun  Dinner     4  0.184
47        32.40   6.00    Male     No   Sun  Dinner     4  0.185
52        34.81   5.20  Female     No   Sun  Dinner     4  0.149
59        48.27   6.73    Male     No   Sat  Dinner     4  0.139
85        34.83   5.17  Female     No  Thur   Lunch     4  0.148
88        24.71   5.85    Male     No  Thur   Lunch     2  0.237
116       29.93   5.07    Male     No   Sun  Dinner     4  0.169
141       34.30   6.70    Male     No  Thur   Lunch     6  0.195
155       29.85   5.14  Female     No   Sun  Dinner     5  0.172
170       50.81  10.00    Male    Yes   Sat  Dinner     3  0.197
172        7.25   5.15    Male    Yes   Sun  Dinner     2  0.710
181       23.33   5.65    Male    Yes   Sun  Dinner     2  0.242
183       23.17   6.50    Male    Yes   Sun  Dinner     4  0.281
211       25.89   5.16    Male    Yes   Sat  Dinner     4  0.199
212       48.33   9.00    Male     No   Sat  Dinner     4  0.186
214       28.17   6.50  Female    Yes   Sat  Dinner     3  0.231
239       29.03   5.92    Male     No   Sat  Dinner     3  0.204

In [170]:
tip_table = pd.read_table('./tips/tip.csv')
tip_table

    total_bill,tip,sex,smoker,day,time,size
0         16.99,1.01,Female,No,Sun,Dinner,2
1           10.34,1.66,Male,No,Sun,Dinner,3
2            21.01,3.5,Male,No,Sun,Dinner,3
3           23.68,3.31,Male,No,Sun,Dinner,2
4         24.59,3.61,Female,No,Sun,Dinner,4
..                                      ...
239         29.03,5.92,Male,No,Sat,Dinner,3
240       27.18,2.0,Female,Yes,Sat,Dinner,2
241         22.67,2.0,Male,Yes,Sat,Dinner,2
242         17.82,1.75,Male,No,Sat,Dinner,2
243       18.78,3.0,Female,No,Thur,Dinner,2

[244 rows x 1 columns]

In [ ]:
tip['bucket'] = np.where(tip['total_bill'] < 20 , 'low', 'high')
tip.head()

   total_bill   tip     sex smoker  day    time  size   rate bucket
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059    low
1       10.34  1.66    Male     No  Sun  Dinner     3  0.161    low
2       21.01  3.50    Male     No  Sun  Dinner     3  0.167   high
3       23.68  3.31    Male     No  Sun  Dinner     2  0.140   high
4       24.59  3.61  Female     No  Sun  Dinner     4  0.147   high

In [173]:
conditions = [
    tip['total_bill'] < 20,                     # bucket 1
    (tip['total_bill'] >= 20) & (tip['total_bill'] < 40),  # bucket 2
    tip['total_bill'] >= 40                     # bucket 3
]

choices = ['low', 'medium', 'high']

tip['bucket'] = np.select(conditions, choices)

tip.head()

   total_bill   tip     sex smoker  day    time  size   rate  bucket
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059     low
1       10.34  1.66    Male     No  Sun  Dinner     3  0.161     low
2       21.01  3.50    Male     No  Sun  Dinner     3  0.167  medium
3       23.68  3.31    Male     No  Sun  Dinner     2  0.140  medium
4       24.59  3.61  Female     No  Sun  Dinner     4  0.147  medium

In [182]:
conditions = [
    tip['total_bill'] < 20,                     # bucket 1
    (tip['total_bill'] >= 20) & (tip['total_bill'] < 40),  # bucket 2
    tip['total_bill'] >= 40                     # bucket 3
]

choices = [0, 1, 2]

tip['bucket_num'] = np.select(conditions, choices)

tip.head()

,total_bill,tip,sex,smoker,day,time,size,rate,bucket,bucket_num
0,16.99,1.01,Female,No,Sun,Dinner,2,0.059,low,0
1,10.34,1.66,Male,No,Sun,Dinner,3,0.161,low,0
2,21.01,3.50,Male,No,Sun,Dinner,3,0.167,medium,1
3,23.68,3.31,Male,No,Sun,Dinner,2,0.140,medium,1
4,24.59,3.61,Female,No,Sun,Dinner,4,0.147,medium,1

In [175]:
tip.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
 7   rate        244 non-null    float64
 8   bucket      244 non-null    object
 9   bucket_num  244 non-null    int32
dtypes: float64(3), int32(1), int64(1), object(5)
memory usage: 18.2+ KB

In [181]:
conditions = [
    tip['total_bill'] < 20,                     # bucket 1
    tip['total_bill'] >= 40                     # bucket 3
]

choices = [10, 11]

tip['bucket_num'] = np.select(conditions, choices)

tip.head()

,total_bill,tip,sex,smoker,day,time,size,rate,bucket,bucket_num
0,16.99,1.01,Female,No,Sun,Dinner,2,0.059,low,10
1,10.34,1.66,Male,No,Sun,Dinner,3,0.161,low,10
2,21.01,3.50,Male,No,Sun,Dinner,3,0.167,medium,0
3,23.68,3.31,Male,No,Sun,Dinner,2,0.140,medium,0
4,24.59,3.61,Female,No,Sun,Dinner,4,0.147,medium,0